---
title: FamilyParameter
classe: Autodesk.Revit.DB.FamilyParameter
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# FamilyParameter

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ParameterSet AssociatedParameters { get; }` | `familyParameter.AssociatedParameters` | ParameterSet |
| `Boolean CanAssignFormula { get; }` | `familyParameter.CanAssignFormula` | Boolean |
| `Definition Definition { get; }` | `familyParameter.Definition` | Definition |
| `String Formula { get; }` | `familyParameter.Formula` | String |
| `Guid GUID { get; }` | `familyParameter.GUID` | Guid |
| `ElementId Id { get; }` | `familyParameter.Id` | ElementId |
| `Boolean IsDeterminedByFormula { get; }` | `familyParameter.IsDeterminedByFormula` | Boolean |
| `Boolean IsInstance { get; }` | `familyParameter.IsInstance` | Boolean |
| `Boolean IsReadOnly { get; }` | `familyParameter.IsReadOnly` | Boolean |
| `Boolean IsReporting { get; }` | `familyParameter.IsReporting` | Boolean |
| `Boolean IsShared { get; }` | `familyParameter.IsShared` | Boolean |
| `StorageType StorageType { get; }` | `familyParameter.StorageType` | StorageType |
| `Boolean UserModifiable { get; }` | `familyParameter.UserModifiable` | Boolean |
| `ForgeTypeId GetUnitTypeId()` | `familyParameter.GetUnitTypeId()` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```